Repository: sonnyp/Junction
Catalog: po/*.po
Languages: ar, fr, gl, it, ja, oc, pl, si

source: Junction
ar: جانكشن

source: Application chooser
ar: منتقي التطبيقات
fr: Sélecteur d’application
gl: Selector de aplicacións
it: Selettore per applicazioni
ja: 続行するアプリケーション選択
oc: Selector d’aplicacion
pl: Wybór aplikacji
si: යෙදුම් තේරීම

source: Junction lets you choose the application to open files and links.
ar: يتيح لك جانكشن اختيار التطبيق لفتح الملفات والروابط.
fr: Junction vous permet de choisir l’application pour ouvrir les fichiers et les liens.
gl: Junction permítelle elexir a aplicación para abrir ficheiros e ligazóns.
it: Junction ti consente di scegliere l'applicazione per aprire file e collegamenti.
ja: Junctionは、ファイルやリンクを開く際に、続行するアプリケーションを選択できるようにします。
oc: Junction vos permet de causir l’aplicacion de dobrir per dobrir los fichièrs e los ligams.
pl: Junction pozwala wybrać aplikację do otwarcia plików i linków.
si: Junction ඔබට ගොනු සහ සබැඳි විවෘත කිරීමට යෙදුම තෝරා ගැනීමට ඉඩ දෙයි.බවට පත් වේ.

source: After installing make sure to launch the application.
ar: بعد التثبيت تأكد من تشغيل التطبيق.
fr: Veuillez ouvrir l'application après l'avoir installé.
gl: Despois da instalación, asegúrese de iniciar a aplicación.
it: Dopo l'installazione assicurati di avviare l'applicazione.
ja: インストール後、必ずアプリケーションを起動してください。
oc: Aprèp l’installacion asseguratz-vos de lançar l’aplicacion.
pl: Po zainstalowaniu uruchom aplikację.
si: ස්ථාපනය කිරීමෙන් පසු යෙදුම දියත් කිරීමට වග බලා ගන්න.

source: Junction will pop up automatically when you open a link in a desktop application. Use the mouse or keyboard navigation to choose the application to open the link or file with.
ar: سينبثق منتقي التطبيقات تلقائيًا عند فتح ارتباط في تطبيق سطح المكتب. استخدم التنقل بالفأرة أو لوحة المفاتيح لاختيار التطبيق لفتح الرابط أو المِلَفّ به.
fr: Jonction s’affiche automatiquement lorsque vous ouvrez un lien dans une application de bureau. Utilisez la souris ou la navigation au clavier pour choisir l’application avec laquelle ouvrir le lien ou le fichier.
gl: Junction aparecerá automaticamente cando abra unha ligazón nunha aplicación de escritorio. Use o rato ou a navegación por teclado para elexir a aplicación coa que abrir a ligazón ou o ficheiro.
it: Junction apparirà automaticamente quando apri un collegamento di un applicazione desktop. Usa la navigazione del mouse o della tastiera per scegliere l'applicazione per aprire il collegamento o file.
ja: デスクトップアプリケーションでリンクを開くと、Junctionが自動的にポップアップします。マウスやキーボードのナビゲーションを使って、リンクやファイルを開くアプリケーションを選択します。
pl: Junction otworzy się automatycznie po otwarciu linku w aplikacji desktopowej. Użyj myszki lub klawiatury do wybrania aplikacji w której ma się otworzyć link lub plik.
si: ඩෙස්ක්ටොප් වැඩසටහනක සබැඳියක් විවෘත කළ විට හන්දිය ස්වයංක්‍රීයව දර්ශනය වේවිවෘත වනු ඇත. පාලනය කිරීමට මූසිකය හෝ යතුරුපුවරුව ගෙනයන්නඔබට සබැඳියක් හෝ ගොනුවක් විවෘත කිරීමට භාවිතා කිරීමට අවශ්‍ය වැඩසටහන තෝරන්න.

source: Features:
ar: المميزات:
fr: Caractéristiques :
gl: Características:
it: Caratteristiche:
ja: 特徴:
oc: Foncionalitats :
pl: Funkcje:
si: විශේෂාංග:

source: Choose the application to open with
ar: يرجى اختيار تطبيق للفتح
fr: Choisissez l’application à ouvrir avec
gl: Elixa a aplicación para abrir con
it: Scegli l'applicazione con cui aprire
ja: アプリケーションを選択して開く
oc: Causir l’aplicacion que se dobrirà
pl: Wybieranie aplikacji do otwarcia
si: විවෘත කිරීමට යෙදුම තෝරන්න

source: Show the location before opening
ar: إظهار المكان قبل الفتح
fr: Montrer l’emplacement avant ouverture
gl: Mostrar a localización antes de abrir
it: Mostra la posizione prima dell'apertura
ja: 開く前に場所を表示する
oc: Afichar l’emplaçament abans de dobrir
pl: Pokazywanie lokalizacji przed otwarciem
si: විවෘත කිරීමට පෙර ස්ථානය පෙන්වන්න

source: Edit the URL before opening
ar: تعديل الرابط قبل الفتح
fr: Modifier l’URL avant ouverture
gl: Editar o URL antes de abrilo
it: Modifica l'URL prima di aprire
ja: 開く前にURLを編集する
oc: Modificar l’URL abans dubertura
pl: Edytowanie URL przed otwarciem
si: විවෘත කිරීමට පෙර URL එක සංස්කරණය කරන්න

source: Show a hint for insecure link
ar: عرض ملاحظة للروابط غير الآمنة
fr: Afficher un indice pour les liens non sécurisés
gl: Mostrar unha advertencia para as ligazóns inseguras
it: Mostra un suggerimento per collegamento non sicuro
ja: 安全でないリンクのヒントを表示する
oc: Afichar un quicomet pels ligams pas segurs
pl: Pokazywanie podpowiedzi przy niezabezpieczonych linkach
si: අනාරක්ෂිත සබැඳිය සඳහා ඉඟියක් පෙන්වන්න

source: Keyboard navigation
ar: التحكم باستخدام لوحة المفاتيح
fr: Navigation au clavier
gl: Navegación por teclado
it: Navigazione da tastiera
ja: キーボードナビゲーション
oc: Navigacion al clavièr
pl: Nawigacja klawiaturą
si: යතුරුපුවරු සංචාලනය

source: Middle click to open in multiple applications
ar: النقر في المنتصف للفتح في تطبيقات عدة
fr: Cliquez au milieu pour ouvrir dans plusieurs applications
gl: Clic central para abrir en varias aplicacións
it: Fare clic con il tasto centrale per aprire in più applicazioni
ja: 中クリックで複数のアプリケーションを開く
oc: Clic de la mitat per dobrir mantuna aplicacion
pl: Otwieranie środkowym przyciskiem myszy w wielu aplikacjach
si: යෙදුම් කිහිපයක විවෘත කිරීමට මැද ක්ලික් කරන්න

source: Choose the browser to open the link with
ar: يرجى اختيار متصفح لفتح الرابط
fr: Choisissez le navigateur avec lequel vous souhaitez ouvrir le lien
gl: elixa o navegador co que desexa abrir a ligazón
it: Scegli il browser con cui aprire il collegamento
ja: リンク先を開くブラウザを選択します
oc: Causir un navigador que dobrirà lo ligam
pl: Wybieranie przeglądarki do otwarcia linku
si: සබැඳිය විවෘත කිරීමට බ්‍රවුසරය තෝරන්න

source: Choose the application to open the image with
ar: يرجى اختيار تطبيق لفتح الصورة
fr: Choisissez l’application avec laquelle vous souhaitez ouvrir l’image
gl: Elixa a aplicación coa que desexa abrir a imaxe
it: Scegli l'applicazione con cui aprire l'immagine
ja: 画像を開くアプリケーションを選択します
si: රූපය විවෘත කිරීමට යෙදුම තෝරන්න

source: Junction features great support for keyboard
ar: جانكشن يقدم دعما كبيرا لاستخدام لوحة المفاتيح
fr: Junction offre une prise en charge optimale du clavier
gl: Junction conta con un gran soporte para o teclado
it: Junction offre un ottimo supporto per la tastiera
ja: Junctionでは、キーボードのサポートが充実しています
si: Junction යතුරුපුවරුව සඳහා විශිෂ්ට සහාය දක්වයි

source: Desktop actions are supported too
ar: أوامر سطح المكتب مدعومة أيضا
fr: Les actions de bureau sont aussi prises en charge
gl: As accións de escritorio tamén son compatíbeis
it: Anche le azioni desktop sono supportate
ja: デスクトップアプリケーションにもサポート
si: ඩෙස්ක්ටොප් ක්‍රියා ද සහය දක්වයි

source: Add an option "Reveal in Folder" for files
ar: إضافة خيار "عرض في المجلد" للملفات
fr: Ajoute une option "Révéler dans le dossier" pour les fichiers
ja: 「フォルダに表示」表示のオプションを追加
si: ගොනු සඳහා "ෆෝල්ඩරයේ හෙළි කරන්න" විකල්පයක් එක් කරන්න

source: Reveal document portal file paths
ar: إظهار مسارات الملفات لبوابة المستند
fr: Révéler les chemins de fichier du portail de documents
si: ලේඛන ද්වාර ගොනු මාර්ග හෙළි කරන්න

source: Bug fix for desktop actions
ar: إصلاح خلل أوامر سطح المكتب
fr: Correction de bogues pour les actions de bureau

source: Bug fix when opening with Libreoffice
ar: إصلاح خلل عند الفتح باستخدام ليبرا أوفيس
fr: Correction de bogues lors de l'ouverture avec Libreoffice
si: Libreoffice සමඟ විවෘත කිරීමේදී දෝෂ නිරාකරණය

source: Support desktop actions
ar: دعم أوامر سطح المكتب
fr: Prend en charge les actions de bureau
gl: Soporte de accións de escritorio
it: Supporta le azioni del desktop
si: ඩෙස්ක්ටොප් ක්‍රියා සඳහා සහය වන්න

source: Support snap applications
ar: دعم تطبيقات سناب
fr: Prend en charge les applications snap
gl: Soporte de aplicacións snap
it: Supporta applicazioni snap
ja: snapアプリケーションに対応
si: Snap යෙදුම් සඳහා සහය දක්වයි

source: Improve design
ar: تحسين التصميم
fr: Conception améliorée
gl: Mellora do deseño
it: Migliorato il design
ja: デザインの改善
si: නිර්මාණය වැඩි දියුණු කරන්න

source: New icon
ar: أيقونة جديدة
fr: Nouvelle icône
gl: Nova icona
it: Nuova icona
ja: 新しいアイコン
si: නව නිරූපකය

source: Add a x-junction:// protocol API
ar: إضافة بروتوكول واجهة x-junction://
fr: Ajouter une API de protocole x-junction://
gl: Engade unha API de protocolo x-junction://
it: Aggiunto un'API del protocollo x-junction://
ja: x-junction:// プロトコル APIを追加

source: Do not automatically set as default application
ar: عدم التحديد كتطبيق افتراضي
fr: Ne pas définir automatiquement comme application par défaut
gl: Non estabelece automaticamente como predeterminado para a Web
it: Non impostare automaticamente come applicazione predefinita
ja: 自動的にデフォルトのアプリケーションとして設定しない
si: පෙරනිමි යෙදුම ලෙස ස්වයංක්‍රීයව සකසන්න එපා

source: Fix missing options
ar: إصلاح خيارات ناقصة
fr: Correction des options manquantes
gl: Corrección das opcións que faltan
it: Corretto le opzioni mancanti
ja: 不足しているオプションの修正
si: නැතිවූ විකල්ප නිවැරදි කරන්න

source: Limit the number of options to 4
ar: تقييد الخيارات إلى 4
fr: Limiter le nombre d’options à 4
gl: Limita o número de opcións a 4
it: Limita il numero di opzioni a 4
ja: アプリケーション選択肢を４つに制限
si: විකල්ප ගණන 4 ට සීමා කරන්න

source: Add an option to open with any application
ar: إضافة خيار للفتح باستخدام أي تطبيق
fr: Ajouter une option permettant d’ouvrir avec n’importe quelle application
gl: Engade unha opción para abrir con calquera aplicación
it: Aggiungi un'opzione per aprire con qualsiasi applicazione
ja: 任意のアプリケーションで開くことができるオプションを追加
si: ඕනෑම යෙදුමක් සමඟ විවෘත කිරීමට විකල්පයක් එක් කරන්න

source: Add a System Information panel in the about dialog
ar: إضافة لوحة معلومات النظام إلى معلومات التطبيق
fr: Ajouter un panneau d’informations sur le système dans la boîte de dialogue à propos
gl: Engade un panel de información do sistema no diálogo de información
it: Aggiungi un pannello Informazioni di sistema nella finestra di dialogo
ja: "Junctionについて" のダイアログに"システム"の項目が追加
si: ගැන සංවාදයේ පද්ධති තොරතුරු පැනලයක් එක් කරන්න

source: Fix for applications that do not support URIs
ar: إصلاح للتطبيقات التي لا تدعم الروابط
fr: Correction pour les applications qui ne prend pas en charge les URI
gl: Corrección para aplicacións que non soporta URIs
it: Risolto il problema con le applicazioni che non supportano gli URI
ja: URIをサポートしていないアプリケーションの修正
si: URI සඳහා සහය නොදක්වන යෙදුම් සඳහා නිවැරදි කරන්න

source: Add an option to display application names
ar: إضافة خيار لعرض أسماء التطبيقات
fr: Ajouter une option pour afficher le nom des applications
gl: Engade unha opción para mostrar os nomes das aplicacións
it: Aggiunto un'opzione per visualizzare i nomi delle applicazioni
ja: アプリケーション名を表示するオプションの追加
si: යෙදුම් නම් පෙන්වීමට විකල්පයක් එක් කරන්න

source: Add a menu button
ar: إضافة زر للقائمة
fr: Ajouter un bouton de menu
gl: Engade un botón de menú
it: Aggiunto un pulsante menu
ja: メニューボタンの追加
si: මෙනු බොත්තමක් එක් කරන්න

source: Improve keyboard usage
ar: تحسين استخدام لوحة المفاتيح
fr: Améliorer l’utilisation du clavier
gl: Mellora o uso do teclado
it: Migliora l'utilizzo della tastiera
ja: キーボード操作性の向上
si: යතුරුපුවරු භාවිතය වැඩි දියුණු කරන්න

source: Improve CLI usage
ar: تحسين استخدام واجهة سطر الأوامر
fr: Améliorer l’utilisation du CLI
gl: Mellora o uso da CLI
it: Migliora l'utilizzo della CLI
ja: CLIの使用方法の改善
si: CLI භාවිතය වැඩි දියුණු කරන්න

source: Support opening multiple URIs
ar: دعم فتح روابط متعددة
fr: Prise en charge de l’ouverture de plusieurs URI
gl: Compatibilidade coa apertura de múltiples URIs
it: Supporta l'apertura di più URI
ja: 複数のURIのオープンをサポート
si: බහු URI විවෘත කිරීමට සහාය වීම

source: Support D-Bus activation
ar: دعم تنشيط D-Bus
fr: Prend en charge l’activation du D-Bus
gl: Soporte da activación do D-Bus
it: Supporta l'attivazione D-Bus
ja: D-Busの起動に対応
si: D-Bus සක්‍රිය කිරීමට සහාය වීම

source: Use libadwaita
ar: استخدام libadwaita
fr: Utiliser libadwaita
gl: Usa libadwaita
it: Usa libadwaita
ja: libadwaitaを使用
si: Libadwaita භාවිතා කරන්න

source: Fix for missing applications
ar: إصلاح للتطبيقات الناقصة
fr: Correction pour les applications manquantes
gl: Correción das aplicacións que faltan
it: Correzione per le applicazioni mancanti
ja: 不足しているアプリケーションの修正
oc: Petaçatge per las aplicacions mancantas
pl: Naprawiono błąd brakujących aplikacji
si: නැතිවූ යෙදුම් සඳහා නිවැරදි කරන්න

source: Add a Shortcuts window - accessible with &lt;Ctrl&gt;?
ar: إضافة نافذة للاختصارات – يمكن الوصول إليها باستخدام &lt;Ctrl&gt;?
fr: Ajout d’une fenêtre de raccourcis - accessible avec &lt;Ctrl&gt;?
gl: Engade unha xanela de atallos - accesíbel con &lt;Ctrl&gt;?
it: Aggiunto una finestra Collegamenti - accessibile con &lt;Ctrl&gt;?
ja: ショートカットキーウィンドウの追加 - &lt;Ctrl&gt;? でアクセスできます
pl: Dodano okno ze Skrótami - dostępne poprzez &lt;Ctrl&gt;?
si: කෙටිමං කවුළුවක් එක් කරන්න - &lt;Ctrl&gt; සමඟින් ප්‍රවේශ විය හැකිද?

source: This is the first release of Junction. We hope you like it.
ar: هذه هي أول نسخة من جانكشن. نأمل أن تنال إعجابك.
fr: Ceci est la première version de Junction. Nous espérons qu’elle vous plaira.
gl: Esta é a primeira versión de Junction. Esperamos que lle guste.
it: Questa è la prima versione di Junction. Speriamo che vi piaccia.
ja: これがJunctionの最初のリリースです。気に入ってもらえれば幸いです。
oc: Aquò es la primièra versionde Junction. Esperam que vos agradarà.
pl: To jest pierwsze wydanie Junction. Mamy nadzieję, że ci się spodoba.
si: මෙය Junction පළමු නිකුතුවයි. ඔබ එයට කැමති යැයි අපි බලාපොරොත්තු වෙමු.

source: This site has no security. An attacker could see any information you send, or control the content that you see.
ar: هذا الموقع ليس آمنا. يمكن للمهاجم رؤية أي معلومات يتم إرسالها أو التحكم بالمحتوى المعروض.
fr: Ce site n’est pas sécurisé. Un attaquant pourrait voir toutes les informations que vous envoyez, ou contrôler le contenu que vous voyez.
gl: Este sitio non ten seguridade. Un atacante podería ver calquera información que envíe, ou controlar o contido que ve.
it: Questo sito non è protetto. Un utente malintenzionato potrebbe vedere tutte le informazioni che invii o controllare il contenuto che vedi.
ja: このサイトにはセキュリティがありません。攻撃者は、あなたが送信した情報を見たり、あなたが見たコンテンツを制御したりすることができます。
oc: Aqueste site es pas securizat. Un atacant pòt veire totas las informacions que mandatz, o contrarotlar çò que consultatz.
pl: Ta strona może nie jest zabezpieczona. Atakujący mógłby widzieć wszystkie informacje które wysyłasz lub kontrolować zawartość, którą widzisz.
si: මෙම අඩවියට ආරක්ෂාවක් නැත. ඔබ යවන ඕනෑම තොරතුරක් ප්‍රහාරකයෙකුට දැකිය හැක, නැතහොත් ඔබ දකින අන්තර්ගතය පාලනය කරන්න.

source: Reveal
ar: عرض
fr: Révéler
gl: Revelar
si: හෙළි කරන්න

source: Reveal in Folder
ar: عرض في المجلد
fr: Révéler dans le dossier
si: ෆෝල්ඩරය තුළ හෙළි කරන්න

source: All Applications
ar: جميع التطبيقات
fr: Toutes les applications
gl: Todas as apliaccións
it: Tutte le applicazioni
ja: すべてのアプリケーション

source: View All
ar: عرض الكل
fr: Tout voir
gl: Ver todo
it: Visualizza tutto
ja: すべて表示

source: Show names
ar: عرض الأسماء
fr: Afficher les noms
gl: Mostrar nomes
it: Mostra nomi
ja: 名前を表示

source: Copy to Clipboard
ar: نسخ إلى الحافظة
fr: Copier dans le presse-papiers
gl: Copiar ao portapapeis
it: Copia negli appunti
ja: クリップボードにコピー
oc: Copiar al quicha-papièrs
pl: Kopiuj do Schowka

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح
fr: Raccourcis clavier
gl: Atallos de teclado
it: Scorciatoie da tastiera
ja: キーボードショートカット
oc: Acorchis de clavièr
pl: Skróty Klawiszowe

source: About Junction
ar: عن جانكشن
fr: À propos de Junction
gl: Sobre Junction
it: Informazioni su Junction
ja: Junctionについて
oc: A prepaus de Junction
pl: O Junction

source: Test Junction
ar: اختبار جانكشن
fr: Tester Junction
gl: Probar Junction
ja: テスト

source: Set Junction as default for Web
ar: تعيين جانكشن تطبيقا افتراضيا للويب
fr: Définir Junction par défaut pour le Web
gl: Estabelecer Junction como predeterminado para a Web
it: Imposta Junction come predefinito per il Web
ja: Junctionをデフォルトのウェブブラウザに設定

source: translator-credits
ar: Ibrahim Muhammad <ibrahim.muhammad.mu@outlook.com>
fr: Jeanne Lavoie
gl: Fran Diéguez <fran.dieguez@gnome.org>, 2021
it: Albano Battistella <albano_battistella@hotmail.com>
ja: Sibuya Kaz <sibuyakazokuu@gmail.com>
oc: Quentin PAGÈS https://www.mejans.fr
pl: tłumaczenia
si: PythonPlumber <mario.yellow.bea@proton.me>

source: Discard and close
ar: تجاهل وإغلاق
fr: Rejeter et fermer
gl: Descartar e pechar

source: Select next/previous application
ar: تحديد التطبيق التالي/السابق
fr: Sélectionner l'application suivante / précédente
gl: Seleccione a seguinte/anterior aplicación

source: Open with selected application
ar: فتح باستخدام التطبيق الذي تم تحديده
fr: Ouvrir avec l'application sélectionnée
gl: Abrir coa aplicación seleccionada

source: Open with selected application and stay active
ar: فتح باستخدام التطبيق الذي تم تحديده والبقاء نشطا
fr: Ouvrir avec l'application sélectionnée et rester actif
gl: Abre coa aplicación seleccionada e mantéñase activo

source: Open with application at position
ar: فتح باستخدام التطبيق في الوضع
fr: Ouvrir avec l’application à la position
ja: 表示されたアプリケーションの位置の番号を選択して表示

source: Quit
ar: خروج
fr: Quitter
gl: Saír
ja: 終了

source: List options by last used
oc: Listar las opcions per usatge recent
pl: Pokazywanie opcji w kolejności od ostatnio użytych

source: Esc to cancel
oc: Esc per anullar
pl: Anulowanie przyciskiem Esc

source: Copy to clipboard
oc: Copiar al quichapapièrs
pl: Kopiowanie do schowka

source: Add Italian translation
oc: Apondon de la traduccion en italian
pl: Dodano Włoskie tłumaczenie

source: Junction has been set as default application for Web
oc: Junction es definit coma aplicacion per defaut pel Web
pl: Aplikacja Junction została ustawiona jako domyślna dla linków internetowych

source: Click here to test
oc: Clicatz aicí per ensajar
pl: Naciśnij tutaj, żeby przetestować

source: Choosey;BrowserChooser;Braus;Browserosaurus;Finicky;Buffet;
oc: causir;percórrer;navegador;navigador;navigator;braus;finicky;buffet;browserosaurus;
